examples/tobias_tutorial/arbitrary_rotating_inlet_ncc/templates/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type                motionSolver;
    libs                ("libfvMotionSolvers.so");

    motionSolver            solidBody;
    solidBodyMotionFunction rotatingMotion;

    cellZone      movingZone;
    origin        (0 0 0);
    axis          (0 0 1);
    omega         3.14; // rad/s
}


// ************************************************************************* //
